case/Rheometer_Git/RheometerValidierung/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            navierSlip;
        wallVelocity    nonuniform List<vector> 
484
(
(-8.59461e-22 0.0129706 0)
(0 0.0137751 0)
(8.625e-22 0.0145796 -0)
(-9.66025e-21 0.0153841 0)
(-8.64935e-22 0.0161887 0)
(-7.87916e-21 0.0169932 0)
(8.34967e-21 0.0177978 -0)
(-8.67797e-22 0.0186024 0)
...
)
;
        slipLength      uniform 5.4e-07;
        value    uniform (0 0 0);
    }
    inlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            navierSlip;
        value           uniform (0 0 0);
        slipLength      uniform 5.4e-07;
        wallVelocity    uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    left
    {
        type            wedge;
    }
    right
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}


// ************************************************************************* //
